import dd from 'dedent'

export const decimalMessage = dd`
✅Регистрируйся в боте @BazerFarming_bot
✅Укажи адрес кошелька, с которого будешь делегировать монеты decimal
✅Делегируй в валидатор  <a href="https://explorer.decimalchain.com/ru/validators/d0valoper1z5vj4tya8vjqpmhxud4xqhynaj26hqfyp2eju2">1%(CASHBACK)</a> с комиссией 15%
✅Получай реварды с валидатора в монете del

ВСЕМ ЗАРЕГИСТРИРОВАННЫМ В БОТЕ ДЕЛЕГАТОРАМ ВАЛИДАТОР ВЫПЛАЧИВАЕТ:
✅ 9% за участие в программе, пропорционально размеру стейка о общем стейке валидатора!
✅ 4% реферальное вознаграждение за построение реферальной структуры,  пропорционально стейкам приглашенных рефералов!

2% комиссии валидатор оставляет себе на покрытие своих издержек!

❗️ Все выплаты  по программе фарминга и реферальные вознаграждения выплачиваются в монете CASHBACK❗️
✅Получай дополнительный доход от роста стоимости монеты CASHBACK
♾️ ВАША РЕФЕРАЛЬНАЯ СТРУКТУРА И ДОХОД ОТ НЕЕ МОГУТ РАСТИ БЕСКОНЕЧНО!
♾️ СТОИМОСТЬ МОНЕТЫ CASHBACK МОЖЕТ РАСТИ БЕСКОНЕЧНО КАК И ВАШ ДОХОД!
❗️Участвуй в программе реферального фарминга❗️
❗️Получай бесконечный рост твоего дохода❗️
`

export const crossFiMessage = dd`
✅Регистрируйся в боте @BazerFarming_bot
✅Укажи адрес кошелька , с которого будешь делегировать монеты crossFi (mpx)
✅Делегируй в валидатор <a href="https://xfiscan.com/validators/mxvaloper128ldptndzl4eeusfa5gnlmhy8dfsl23kxsd69y">1️⃣⬆️(CASHBACK)</a> с комиссией 5%

ВСЕМ ЗАРЕГИСТРИРОВАННЫМ В БОТЕ ДЕЛЕГАТОРАМ ВАЛИДАТОР ВЫПЛАЧИВАЕТ:
✅ 2.5% за участие в программе, пропорционально размеру стейка о общем стейке валидатора!
✅ 1.5% реферальное вознаграждение за построение реферальной структуры,  пропорционально стейкам приглашенных рефералов!

1% комиссии валидатор оставляет себе на покрытие своих издержек!

❗️Участвуй в программе реферального фарминга❗️
❗️Получай бесконечный рост твоего дохода❗️
`
